MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E1C11D0AGV20000/mcu.h
/*******************************************************************************
* SBSSR Registers SBSSR
*   Register Definition
*******************************************************************************/
#define FM_SBSSR_BTSSSR                           *((volatile uint16_t*)(0x40025FFCUL))
#define FM0P_SBSSR_BTSSSR                         *((volatile uint16_t*)(0x40025FFCUL))

/*******************************************************************************
* SMCIF Registers SMCIF1
*   Register Definition
*******************************************************************************/
#define FM_SMCIF1_GLOBALCONTROL1                  *((volatile uint16_t*)(0x4003C980UL))
#define FM0P_SMCIF1_GLOBALCONTROL1                *((volatile uint16_t*)(0x4003C980UL))
#define FM_SMCIF1_STATUS                          *((volatile uint16_t*)(0x4003C984UL))
#define FM0P_SMCIF1_STATUS                        *((volatile uint16_t*)(0x4003C984UL))
#define FM_SMCIF1_PORTCONTROL                     *((volatile uint16_t*)(0x4003C988UL))
#define FM0P_SMCIF1_PORTCONTROL                   *((volatile uint16_t*)(0x4003C988UL))
#define FM_SMCIF1_DATA                            *((volatile uint16_t*)(0x4003C98CUL))
#define FM0P_SMCIF1_DATA                          *((volatile uint16_t*)(0x4003C98CUL))
#define FM_SMCIF1_CARDCLOCK                       *((volatile uint16_t*)(0x4003C990UL))
#define FM0P_SMCIF1_CARDCLOCK                     *((volatile uint16_t*)(0x4003C990UL))
#define FM_SMCIF1_BAUDRATE                        *((volatile uint16_t*)(0x4003C994UL))
#define FM0P_SMCIF1_BAUDRATE                      *((volatile uint16_t*)(0x4003C994UL))
#define FM_SMCIF1_GUARDTIMER                      *((volatile uint16_t*)(0x4003C998UL))
#define FM0P_SMCIF1_GUARDTIMER                    *((volatile uint16_t*)(0x4003C998UL))
#define FM_SMCIF1_IDLETIMER                       *((volatile uint16_t*)(0x4003C99CUL))
#define FM0P_SMCIF1_IDLETIMER                     *((volatile uint16_t*)(0x4003C99CUL))
#define FM_SMCIF1_GLOBALCONTROL2                  *((volatile uint16_t*)(0x4003C9A0UL))
#define FM0P_SMCIF1_GLOBALCONTROL2                *((volatile uint16_t*)(0x4003C9A0UL))
#define FM_SMCIF1_DATA_FIFO                       *((volatile uint16_t*)(0x4003C9A4UL))
#define FM0P_SMCIF1_DATA_FIFO                     *((volatile uint16_t*)(0x4003C9A4UL))
#define FM_SMCIF1_FIFO_LEVEL_READ                 *((volatile uint16_t*)(0x4003C9A8UL))
#define FM0P_SMCIF1_FIFO_LEVEL_READ               *((volatile uint16_t*)(0x4003C9A8UL))
#define FM_SMCIF1_FIFO_LEVEL_WRITE                *((volatile uint16_t*)(0x4003C9ACUL))
#define FM0P_SMCIF1_FIFO_LEVEL_WRITE              *((volatile uint16_t*)(0x4003C9ACUL))
#define FM_SMCIF1_FIFO_MODE                       *((volatile uint16_t*)(0x4003C9B0UL))
#define FM0P_SMCIF1_FIFO_MODE                     *((volatile uint16_t*)(0x4003C9B0UL))
#define FM_SMCIF1_FIFO_CLEAR_MSB_WRITE            *((volatile uint16_t*)(0x4003C9B4UL))
#define FM0P_SMCIF1_FIFO_CLEAR_MSB_WRITE          *((volatile uint16_t*)(0x4003C9B4UL))
#define FM_SMCIF1_FIFO_CLEAR_MSB_READ             *((volatile uint16_t*)(0x4003C9B8UL))
#define FM0P_SMCIF1_FIFO_CLEAR_MSB_READ           *((volatile uint16_t*)(0x4003C9B8UL))
#define FM_SMCIF1_IRQ_STATUS                      *((volatile uint16_t*)(0x4003C9C0UL))
#define FM0P_SMCIF1_IRQ_STATUS                    *((volatile uint16_t*)(0x4003C9C0UL))

/*******************************************************************************
* SWWDT Registers SWWDT
*   Register Definition
*******************************************************************************/
#define FM_SWWDT_WDOGLOAD                         *((volatile uint32_t*)(0x40012000UL))
#define FM0P_SWWDT_WDOGLOAD                       *((volatile uint32_t*)(0x40012000UL))
#define FM_SWWDT_WDOGVALUE                        *((volatile uint32_t*)(0x40012004UL))
#define FM0P_SWWDT_WDOGVALUE                      *((volatile uint32_t*)(0x40012004UL))
#define FM_SWWDT_WDOGCONTROL                      *((volatile uint32_t*)(0x40012008UL))
#define FM0P_SWWDT_WDOGCONTROL                    *((volatile uint32_t*)(0x40012008UL))
#define FM_SWWDT_WDOGINTCLR                       *((volatile uint32_t*)(0x4001200CUL))
#define FM0P_SWWDT_WDOGINTCLR                     *((volatile uint32_t*)(0x4001200CUL))
#define FM_SWWDT_WDOGRIS                          *((volatile uint32_t*)(0x40012010UL))
#define FM0P_SWWDT_WDOGRIS                        *((volatile uint32_t*)(0x40012010UL))
#define FM_SWWDT_WDOGSPMC                         *((volatile uint32_t*)(0x40012018UL))
#define FM0P_SWWDT_WDOGSPMC                       *((volatile uint32_t*)(0x40012018UL))
#define FM_SWWDT_WDOGLOCK                         *((volatile uint32_t*)(0x40012C00UL))
#define FM0P_SWWDT_WDOGLOCK                       *((volatile uint32_t*)(0x40012C00UL))

/*******************************************************************************
* UNIQUE_ID Registers UNIQUE_ID
*   Register Definition
*******************************************************************************/
#define FM_UNIQUE_ID_UIDR0                        *((volatile uint32_t*)(0x40000200UL))
#define FM0P_UNIQUE_ID_UIDR0                      *((volatile uint32_t*)(0x40000200UL))
#define FM_UNIQUE_ID_UIDR1                        *((volatile uint32_t*)(0x40000204UL))
#define FM0P_UNIQUE_ID_UIDR1                      *((volatile uint32_t*)(0x40000204UL))

/*******************************************************************************
* VIR Registers VIR
*   Register Definition
*******************************************************************************/
#define FM_VIR_VIR00                              *((volatile uint32_t*)(0xF8000100UL))
#define FM0P_VIR_VIR00                            *((volatile uint32_t*)(0xF8000100UL))
#define FM_VIR_VIR01                              *((volatile uint32_t*)(0xF8000104UL))
#define FM0P_VIR_VIR01                            *((volatile uint32_t*)(0xF8000104UL))
#define FM_VIR_VIR02                              *((volatile uint32_t*)(0xF8000108UL))
#define FM0P_VIR_VIR02                            *((volatile uint32_t*)(0xF8000108UL))
#define FM_VIR_VIR03                              *((volatile uint32_t*)(0xF800010CUL))
#define FM0P_VIR_VIR03                            *((volatile uint32_t*)(0xF800010CUL))
#define FM_VIR_VIR04                              *((volatile uint32_t*)(0xF8000110UL))
#define FM0P_VIR_VIR04                            *((volatile uint32_t*)(0xF8000110UL))
#define FM_VIR_VIR05                              *((volatile uint32_t*)(0xF8000114UL))
#define FM0P_VIR_VIR05                            *((volatile uint32_t*)(0xF8000114UL))
#define FM_VIR_VIR06                              *((volatile uint32_t*)(0xF8000118UL))
#define FM0P_VIR_VIR06                            *((volatile uint32_t*)(0xF8000118UL))
#define FM_VIR_VIR07                              *((volatile uint32_t*)(0xF800011CUL))
#define FM0P_VIR_VIR07                            *((volatile uint32_t*)(0xF800011CUL))
#define FM_VIR_VIR08                              *((volatile uint32_t*)(0xF8000120UL))
#define FM0P_VIR_VIR08                            *((volatile uint32_t*)(0xF8000120UL))
#define FM_VIR_VIR09                              *((volatile uint32_t*)(0xF8000124UL))
#define FM0P_VIR_VIR09                            *((volatile uint32_t*)(0xF8000124UL))
#define FM_VIR_VIR10                              *((volatile uint32_t*)(0xF8000128UL))
#define FM0P_VIR_VIR10                            *((volatile uint32_t*)(0xF8000128UL))
#define FM_VIR_VIR11                              *((volatile uint32_t*)(0xF800012CUL))
#define FM0P_VIR_VIR11                            *((volatile uint32_t*)(0xF800012CUL))
#define FM_VIR_VIR12                              *((volatile uint32_t*)(0xF8000130UL))
#define FM0P_VIR_VIR12                            *((volatile uint32_t*)(0xF8000130UL))
#define FM_VIR_VIR13                              *((volatile uint32_t*)(0xF8000134UL))
#define FM0P_VIR_VIR13                            *((volatile uint32_t*)(0xF8000134UL))
#define FM_VIR_VIR14                              *((volatile uint32_t*)(0xF8000138UL))
#define FM0P_VIR_VIR14                            *((volatile uint32_t*)(0xF8000138UL))
#define FM_VIR_VIR15                              *((volatile uint32_t*)(0xF800013CUL))
#define FM0P_VIR_VIR15                            *((volatile uint32_t*)(0xF800013CUL))
#define FM_VIR_VIR16                              *((volatile uint32_t*)(0xF8000140UL))
#define FM0P_VIR_VIR16                            *((volatile uint32_t*)(0xF8000140UL))
#define FM_VIR_VIR17                              *((volatile uint32_t*)(0xF8000144UL))
#define FM0P_VIR_VIR17                            *((volatile uint32_t*)(0xF8000144UL))
#define FM_VIR_VIR18                              *((volatile uint32_t*)(0xF8000148UL))
#define FM0P_VIR_VIR18                            *((volatile uint32_t*)(0xF8000148UL))
#define FM_VIR_VIR19                              *((volatile uint32_t*)(0xF800014CUL))
#define FM0P_VIR_VIR19                            *((volatile uint32_t*)(0xF800014CUL))
#define FM_VIR_VIR20                              *((volatile uint32_t*)(0xF8000150UL))
#define FM0P_VIR_VIR20                            *((volatile uint32_t*)(0xF8000150UL))
#define FM_VIR_VIR21                              *((volatile uint32_t*)(0xF8000154UL))
#define FM0P_VIR_VIR21                            *((volatile uint32_t*)(0xF8000154UL))
#define FM_VIR_VIR22                              *((volatile uint32_t*)(0xF8000158UL))
#define FM0P_VIR_VIR22                            *((volatile uint32_t*)(0xF8000158UL))
#define FM_VIR_VIR23                              *((volatile uint32_t*)(0xF800015CUL))
#define FM0P_VIR_VIR23                            *((volatile uint32_t*)(0xF800015CUL))
#define FM_VIR_VIR24                              *((volatile uint32_t*)(0xF8000160UL))
#define FM0P_VIR_VIR24                            *((volatile uint32_t*)(0xF8000160UL))
#define FM_VIR_VIR25                              *((volatile uint32_t*)(0xF8000164UL))
#define FM0P_VIR_VIR25                            *((volatile uint32_t*)(0xF8000164UL))
#define FM_VIR_VIR26                              *((volatile uint32_t*)(0xF8000168UL))
#define FM0P_VIR_VIR26                            *((volatile uint32_t*)(0xF8000168UL))
#define FM_VIR_VIR27                              *((volatile uint32_t*)(0xF800016CUL))
#define FM0P_VIR_VIR27                            *((volatile uint32_t*)(0xF800016CUL))
#define FM_VIR_VIR28                              *((volatile uint32_t*)(0xF8000170UL))
#define FM0P_VIR_VIR28                            *((volatile uint32_t*)(0xF8000170UL))
#define FM_VIR_VIR29                              *((volatile uint32_t*)(0xF8000174UL))
#define FM0P_VIR_VIR29                            *((volatile uint32_t*)(0xF8000174UL))
#define FM_VIR_VIR30                              *((volatile uint32_t*)(0xF8000178UL))
#define FM0P_VIR_VIR30                            *((volatile uint32_t*)(0xF8000178UL))
#define FM_VIR_VIR31                              *((volatile uint32_t*)(0xF800017CUL))
#define FM0P_VIR_VIR31                            *((volatile uint32_t*)(0xF800017CUL))

