MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E1C11D0AGV20000/mcu.h
#define bFM_GPIO_PDOR5_P0                         *((volatile  uint8_t *)(0x42668280UL))
#define bFM0P_GPIO_PDOR5_P0                       *((volatile  uint8_t *)(0x42668280UL))
#define bFM_GPIO_PDOR5_P1                         *((volatile  uint8_t *)(0x42668284UL))
#define bFM0P_GPIO_PDOR5_P1                       *((volatile  uint8_t *)(0x42668284UL))
#define bFM_GPIO_PDOR5_P2                         *((volatile  uint8_t *)(0x42668288UL))
#define bFM0P_GPIO_PDOR5_P2                       *((volatile  uint8_t *)(0x42668288UL))
#define bFM_GPIO_PDOR5_P3                         *((volatile  uint8_t *)(0x4266828CUL))
#define bFM0P_GPIO_PDOR5_P3                       *((volatile  uint8_t *)(0x4266828CUL))

#define bFM_GPIO_PDOR6_P0                         *((volatile  uint8_t *)(0x42668300UL))
#define bFM0P_GPIO_PDOR6_P0                       *((volatile  uint8_t *)(0x42668300UL))
#define bFM_GPIO_PDOR6_P1                         *((volatile  uint8_t *)(0x42668304UL))
#define bFM0P_GPIO_PDOR6_P1                       *((volatile  uint8_t *)(0x42668304UL))

#define bFM_GPIO_PDOR8_P0                         *((volatile  uint8_t *)(0x42668400UL))
#define bFM0P_GPIO_PDOR8_P0                       *((volatile  uint8_t *)(0x42668400UL))
#define bFM_GPIO_PDOR8_P1                         *((volatile  uint8_t *)(0x42668404UL))
#define bFM0P_GPIO_PDOR8_P1                       *((volatile  uint8_t *)(0x42668404UL))

#define bFM_GPIO_PDORE_P2                         *((volatile  uint8_t *)(0x42668708UL))
#define bFM0P_GPIO_PDORE_P2                       *((volatile  uint8_t *)(0x42668708UL))
#define bFM_GPIO_PDORE_P3                         *((volatile  uint8_t *)(0x4266870CUL))
#define bFM0P_GPIO_PDORE_P3                       *((volatile  uint8_t *)(0x4266870CUL))

#define bFM_GPIO_PFR0_P0                          *((volatile  uint8_t *)(0x42660000UL))
#define bFM0P_GPIO_PFR0_P0                        *((volatile  uint8_t *)(0x42660000UL))
#define bFM_GPIO_PFR0_P1                          *((volatile  uint8_t *)(0x42660004UL))
#define bFM0P_GPIO_PFR0_P1                        *((volatile  uint8_t *)(0x42660004UL))
#define bFM_GPIO_PFR0_P2                          *((volatile  uint8_t *)(0x42660008UL))
#define bFM0P_GPIO_PFR0_P2                        *((volatile  uint8_t *)(0x42660008UL))
#define bFM_GPIO_PFR0_P3                          *((volatile  uint8_t *)(0x4266000CUL))
#define bFM0P_GPIO_PFR0_P3                        *((volatile  uint8_t *)(0x4266000CUL))
#define bFM_GPIO_PFR0_P5                          *((volatile  uint8_t *)(0x42660014UL))
#define bFM0P_GPIO_PFR0_P5                        *((volatile  uint8_t *)(0x42660014UL))
#define bFM_GPIO_PFR0_PB                          *((volatile  uint8_t *)(0x4266002CUL))
#define bFM0P_GPIO_PFR0_PB                        *((volatile  uint8_t *)(0x4266002CUL))
#define bFM_GPIO_PFR0_PC                          *((volatile  uint8_t *)(0x42660030UL))
#define bFM0P_GPIO_PFR0_PC                        *((volatile  uint8_t *)(0x42660030UL))
#define bFM_GPIO_PFR0_PF                          *((volatile  uint8_t *)(0x4266003CUL))
#define bFM0P_GPIO_PFR0_PF                        *((volatile  uint8_t *)(0x4266003CUL))

#define bFM_GPIO_PFR1_P0                          *((volatile  uint8_t *)(0x42660080UL))
#define bFM0P_GPIO_PFR1_P0                        *((volatile  uint8_t *)(0x42660080UL))
#define bFM_GPIO_PFR1_P1                          *((volatile  uint8_t *)(0x42660084UL))
#define bFM0P_GPIO_PFR1_P1                        *((volatile  uint8_t *)(0x42660084UL))
#define bFM_GPIO_PFR1_P2                          *((volatile  uint8_t *)(0x42660088UL))
#define bFM0P_GPIO_PFR1_P2                        *((volatile  uint8_t *)(0x42660088UL))
#define bFM_GPIO_PFR1_P3                          *((volatile  uint8_t *)(0x4266008CUL))
#define bFM0P_GPIO_PFR1_P3                        *((volatile  uint8_t *)(0x4266008CUL))
#define bFM_GPIO_PFR1_P4                          *((volatile  uint8_t *)(0x42660090UL))
#define bFM0P_GPIO_PFR1_P4                        *((volatile  uint8_t *)(0x42660090UL))
#define bFM_GPIO_PFR1_P5                          *((volatile  uint8_t *)(0x42660094UL))
#define bFM0P_GPIO_PFR1_P5                        *((volatile  uint8_t *)(0x42660094UL))
#define bFM_GPIO_PFR1_PA                          *((volatile  uint8_t *)(0x426600A8UL))
#define bFM0P_GPIO_PFR1_PA                        *((volatile  uint8_t *)(0x426600A8UL))
#define bFM_GPIO_PFR1_PB                          *((volatile  uint8_t *)(0x426600ACUL))
#define bFM0P_GPIO_PFR1_PB                        *((volatile  uint8_t *)(0x426600ACUL))
#define bFM_GPIO_PFR1_PC                          *((volatile  uint8_t *)(0x426600B0UL))
#define bFM0P_GPIO_PFR1_PC                        *((volatile  uint8_t *)(0x426600B0UL))
#define bFM_GPIO_PFR1_PD                          *((volatile  uint8_t *)(0x426600B4UL))
#define bFM0P_GPIO_PFR1_PD                        *((volatile  uint8_t *)(0x426600B4UL))
#define bFM_GPIO_PFR1_PE                          *((volatile  uint8_t *)(0x426600B8UL))
#define bFM0P_GPIO_PFR1_PE                        *((volatile  uint8_t *)(0x426600B8UL))
#define bFM_GPIO_PFR1_PF                          *((volatile  uint8_t *)(0x426600BCUL))
#define bFM0P_GPIO_PFR1_PF                        *((volatile  uint8_t *)(0x426600BCUL))

#define bFM_GPIO_PFR2_P1                          *((volatile  uint8_t *)(0x42660104UL))
#define bFM0P_GPIO_PFR2_P1                        *((volatile  uint8_t *)(0x42660104UL))
#define bFM_GPIO_PFR2_P2                          *((volatile  uint8_t *)(0x42660108UL))
#define bFM0P_GPIO_PFR2_P2                        *((volatile  uint8_t *)(0x42660108UL))
#define bFM_GPIO_PFR2_P3                          *((volatile  uint8_t *)(0x4266010CUL))
#define bFM0P_GPIO_PFR2_P3                        *((volatile  uint8_t *)(0x4266010CUL))

#define bFM_GPIO_PFR3_P0                          *((volatile  uint8_t *)(0x42660180UL))
#define bFM0P_GPIO_PFR3_P0                        *((volatile  uint8_t *)(0x42660180UL))
#define bFM_GPIO_PFR3_P1                          *((volatile  uint8_t *)(0x42660184UL))
#define bFM0P_GPIO_PFR3_P1                        *((volatile  uint8_t *)(0x42660184UL))
#define bFM_GPIO_PFR3_P2                          *((volatile  uint8_t *)(0x42660188UL))
#define bFM0P_GPIO_PFR3_P2                        *((volatile  uint8_t *)(0x42660188UL))
#define bFM_GPIO_PFR3_P3                          *((volatile  uint8_t *)(0x4266018CUL))
#define bFM0P_GPIO_PFR3_P3                        *((volatile  uint8_t *)(0x4266018CUL))
#define bFM_GPIO_PFR3_P4                          *((volatile  uint8_t *)(0x42660190UL))
#define bFM0P_GPIO_PFR3_P4                        *((volatile  uint8_t *)(0x42660190UL))
#define bFM_GPIO_PFR3_P5                          *((volatile  uint8_t *)(0x42660194UL))
#define bFM0P_GPIO_PFR3_P5                        *((volatile  uint8_t *)(0x42660194UL))
#define bFM_GPIO_PFR3_PA                          *((volatile  uint8_t *)(0x426601A8UL))
#define bFM0P_GPIO_PFR3_PA                        *((volatile  uint8_t *)(0x426601A8UL))
#define bFM_GPIO_PFR3_PB                          *((volatile  uint8_t *)(0x426601ACUL))
#define bFM0P_GPIO_PFR3_PB                        *((volatile  uint8_t *)(0x426601ACUL))
#define bFM_GPIO_PFR3_PC                          *((volatile  uint8_t *)(0x426601B0UL))
#define bFM0P_GPIO_PFR3_PC                        *((volatile  uint8_t *)(0x426601B0UL))
#define bFM_GPIO_PFR3_PD                          *((volatile  uint8_t *)(0x426601B4UL))
#define bFM0P_GPIO_PFR3_PD                        *((volatile  uint8_t *)(0x426601B4UL))
#define bFM_GPIO_PFR3_PE                          *((volatile  uint8_t *)(0x426601B8UL))
#define bFM0P_GPIO_PFR3_PE                        *((volatile  uint8_t *)(0x426601B8UL))
#define bFM_GPIO_PFR3_PF                          *((volatile  uint8_t *)(0x426601BCUL))
#define bFM0P_GPIO_PFR3_PF                        *((volatile  uint8_t *)(0x426601BCUL))

#define bFM_GPIO_PFR4_P0                          *((volatile  uint8_t *)(0x42660200UL))
#define bFM0P_GPIO_PFR4_P0                        *((volatile  uint8_t *)(0x42660200UL))
#define bFM_GPIO_PFR4_P1                          *((volatile  uint8_t *)(0x42660204UL))
#define bFM0P_GPIO_PFR4_P1                        *((volatile  uint8_t *)(0x42660204UL))
#define bFM_GPIO_PFR4_P2                          *((volatile  uint8_t *)(0x42660208UL))
#define bFM0P_GPIO_PFR4_P2                        *((volatile  uint8_t *)(0x42660208UL))
#define bFM_GPIO_PFR4_P3                          *((volatile  uint8_t *)(0x4266020CUL))
#define bFM0P_GPIO_PFR4_P3                        *((volatile  uint8_t *)(0x4266020CUL))
#define bFM_GPIO_PFR4_P6                          *((volatile  uint8_t *)(0x42660218UL))
#define bFM0P_GPIO_PFR4_P6                        *((volatile  uint8_t *)(0x42660218UL))
#define bFM_GPIO_PFR4_P7                          *((volatile  uint8_t *)(0x4266021CUL))
#define bFM0P_GPIO_PFR4_P7                        *((volatile  uint8_t *)(0x4266021CUL))
#define bFM_GPIO_PFR4_PC                          *((volatile  uint8_t *)(0x42660230UL))
#define bFM0P_GPIO_PFR4_PC                        *((volatile  uint8_t *)(0x42660230UL))
#define bFM_GPIO_PFR4_PD                          *((volatile  uint8_t *)(0x42660234UL))
#define bFM0P_GPIO_PFR4_PD                        *((volatile  uint8_t *)(0x42660234UL))
#define bFM_GPIO_PFR4_PE                          *((volatile  uint8_t *)(0x42660238UL))
#define bFM0P_GPIO_PFR4_PE                        *((volatile  uint8_t *)(0x42660238UL))

#define bFM_GPIO_PFR5_P0                          *((volatile  uint8_t *)(0x42660280UL))
#define bFM0P_GPIO_PFR5_P0                        *((volatile  uint8_t *)(0x42660280UL))
#define bFM_GPIO_PFR5_P1                          *((volatile  uint8_t *)(0x42660284UL))
#define bFM0P_GPIO_PFR5_P1                        *((volatile  uint8_t *)(0x42660284UL))
#define bFM_GPIO_PFR5_P2                          *((volatile  uint8_t *)(0x42660288UL))
#define bFM0P_GPIO_PFR5_P2                        *((volatile  uint8_t *)(0x42660288UL))
#define bFM_GPIO_PFR5_P3                          *((volatile  uint8_t *)(0x4266028CUL))
#define bFM0P_GPIO_PFR5_P3                        *((volatile  uint8_t *)(0x4266028CUL))

#define bFM_GPIO_PFR6_P0                          *((volatile  uint8_t *)(0x42660300UL))
#define bFM0P_GPIO_PFR6_P0                        *((volatile  uint8_t *)(0x42660300UL))
#define bFM_GPIO_PFR6_P1                          *((volatile  uint8_t *)(0x42660304UL))
#define bFM0P_GPIO_PFR6_P1                        *((volatile  uint8_t *)(0x42660304UL))

