MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E1C11D0AGV20000/mcu.h
/*******************************************************************************
* HDMICEC Registers HDMICEC1
*   Bitband Section
*******************************************************************************/
#define bFM_HDMICEC1_RCCKD_CKSEL                  *((volatile  uint16_t*)(0x42682B30UL))
#define bFM0P_HDMICEC1_RCCKD_CKSEL                *((volatile  uint16_t*)(0x42682B30UL))

#define bFM_HDMICEC1_RCCR_EN                      *((volatile  uint8_t *)(0x42682820UL))
#define bFM0P_HDMICEC1_RCCR_EN                    *((volatile  uint8_t *)(0x42682820UL))
#define bFM_HDMICEC1_RCCR_ADRCE                   *((volatile  uint8_t *)(0x4268282CUL))
#define bFM0P_HDMICEC1_RCCR_ADRCE                 *((volatile  uint8_t *)(0x4268282CUL))
#define bFM_HDMICEC1_RCCR_THSEL                   *((volatile  uint8_t *)(0x4268283CUL))
#define bFM0P_HDMICEC1_RCCR_THSEL                 *((volatile  uint8_t *)(0x4268283CUL))

#define bFM_HDMICEC1_RCLE_LES                     *((volatile  uint8_t *)(0x42682C20UL))
#define bFM0P_HDMICEC1_RCLE_LES                   *((volatile  uint8_t *)(0x42682C20UL))
#define bFM_HDMICEC1_RCLE_LEL                     *((volatile  uint8_t *)(0x42682C24UL))
#define bFM0P_HDMICEC1_RCLE_LEL                   *((volatile  uint8_t *)(0x42682C24UL))
#define bFM_HDMICEC1_RCLE_EPE                     *((volatile  uint8_t *)(0x42682C2CUL))
#define bFM0P_HDMICEC1_RCLE_EPE                   *((volatile  uint8_t *)(0x42682C2CUL))
#define bFM_HDMICEC1_RCLE_LESE                    *((volatile  uint8_t *)(0x42682C30UL))
#define bFM0P_HDMICEC1_RCLE_LESE                  *((volatile  uint8_t *)(0x42682C30UL))
#define bFM_HDMICEC1_RCLE_LELE                    *((volatile  uint8_t *)(0x42682C34UL))
#define bFM0P_HDMICEC1_RCLE_LELE                  *((volatile  uint8_t *)(0x42682C34UL))
#define bFM_HDMICEC1_RCLE_LESIE                   *((volatile  uint8_t *)(0x42682C38UL))
#define bFM0P_HDMICEC1_RCLE_LESIE                 *((volatile  uint8_t *)(0x42682C38UL))
#define bFM_HDMICEC1_RCLE_LELIE                   *((volatile  uint8_t *)(0x42682C3CUL))
#define bFM0P_HDMICEC1_RCLE_LELIE                 *((volatile  uint8_t *)(0x42682C3CUL))

#define bFM_HDMICEC1_RCRC_RC                      *((volatile  uint8_t *)(0x42682BA0UL))
#define bFM0P_HDMICEC1_RCRC_RC                    *((volatile  uint8_t *)(0x42682BA0UL))
#define bFM_HDMICEC1_RCRC_RCIE                    *((volatile  uint8_t *)(0x42682BB0UL))
#define bFM0P_HDMICEC1_RCRC_RCIE                  *((volatile  uint8_t *)(0x42682BB0UL))

#define bFM_HDMICEC1_RCST_OVF                     *((volatile  uint8_t *)(0x42682800UL))
#define bFM0P_HDMICEC1_RCST_OVF                   *((volatile  uint8_t *)(0x42682800UL))
#define bFM_HDMICEC1_RCST_EOM                     *((volatile  uint8_t *)(0x42682804UL))
#define bFM0P_HDMICEC1_RCST_EOM                   *((volatile  uint8_t *)(0x42682804UL))
#define bFM_HDMICEC1_RCST_ACK                     *((volatile  uint8_t *)(0x42682808UL))
#define bFM0P_HDMICEC1_RCST_ACK                   *((volatile  uint8_t *)(0x42682808UL))
#define bFM_HDMICEC1_RCST_ST                      *((volatile  uint8_t *)(0x4268280CUL))
#define bFM0P_HDMICEC1_RCST_ST                    *((volatile  uint8_t *)(0x4268280CUL))
#define bFM_HDMICEC1_RCST_OVFSEL                  *((volatile  uint8_t *)(0x42682810UL))
#define bFM0P_HDMICEC1_RCST_OVFSEL                *((volatile  uint8_t *)(0x42682810UL))
#define bFM_HDMICEC1_RCST_OVFIE                   *((volatile  uint8_t *)(0x42682814UL))
#define bFM0P_HDMICEC1_RCST_OVFIE                 *((volatile  uint8_t *)(0x42682814UL))
#define bFM_HDMICEC1_RCST_ACKIE                   *((volatile  uint8_t *)(0x42682818UL))
#define bFM0P_HDMICEC1_RCST_ACKIE                 *((volatile  uint8_t *)(0x42682818UL))
#define bFM_HDMICEC1_RCST_STIE                    *((volatile  uint8_t *)(0x4268281CUL))
#define bFM0P_HDMICEC1_RCST_STIE                  *((volatile  uint8_t *)(0x4268281CUL))

#define bFM_HDMICEC1_TXCTRL_TXEN                  *((volatile  uint8_t *)(0x42682000UL))
#define bFM0P_HDMICEC1_TXCTRL_TXEN                *((volatile  uint8_t *)(0x42682000UL))
#define bFM_HDMICEC1_TXCTRL_START                 *((volatile  uint8_t *)(0x42682008UL))
#define bFM0P_HDMICEC1_TXCTRL_START               *((volatile  uint8_t *)(0x42682008UL))
#define bFM_HDMICEC1_TXCTRL_EOM                   *((volatile  uint8_t *)(0x4268200CUL))
#define bFM0P_HDMICEC1_TXCTRL_EOM                 *((volatile  uint8_t *)(0x4268200CUL))
#define bFM_HDMICEC1_TXCTRL_ITSTEN                *((volatile  uint8_t *)(0x42682010UL))
#define bFM0P_HDMICEC1_TXCTRL_ITSTEN              *((volatile  uint8_t *)(0x42682010UL))
#define bFM_HDMICEC1_TXCTRL_IBREN                 *((volatile  uint8_t *)(0x42682014UL))
#define bFM0P_HDMICEC1_TXCTRL_IBREN               *((volatile  uint8_t *)(0x42682014UL))

#define bFM_HDMICEC1_TXSTS_ACKSV                  *((volatile  uint8_t *)(0x42682100UL))
#define bFM0P_HDMICEC1_TXSTS_ACKSV                *((volatile  uint8_t *)(0x42682100UL))
#define bFM_HDMICEC1_TXSTS_ITST                   *((volatile  uint8_t *)(0x42682110UL))
#define bFM0P_HDMICEC1_TXSTS_ITST                 *((volatile  uint8_t *)(0x42682110UL))
#define bFM_HDMICEC1_TXSTS_IBR                    *((volatile  uint8_t *)(0x42682114UL))
#define bFM0P_HDMICEC1_TXSTS_IBR                  *((volatile  uint8_t *)(0x42682114UL))


/*******************************************************************************
* HWWDT Registers HWWDT
*   Bitband Section
*******************************************************************************/
#define bFM_HWWDT_WDG_CTL_INTEN                   *((volatile  uint32_t*)(0x42220100UL))
#define bFM0P_HWWDT_WDG_CTL_INTEN                 *((volatile  uint32_t*)(0x42220100UL))
#define bFM_HWWDT_WDG_CTL_RESEN                   *((volatile  uint32_t*)(0x42220104UL))
#define bFM0P_HWWDT_WDG_CTL_RESEN                 *((volatile  uint32_t*)(0x42220104UL))

#define bFM_HWWDT_WDG_RIS_RIS                     *((volatile  uint32_t*)(0x42220200UL))
#define bFM0P_HWWDT_WDG_RIS_RIS                   *((volatile  uint32_t*)(0x42220200UL))


